Tekla.Structures.Analysis.AnalysisModelIssue.SeverityEnum
Issue severity.

Tekla.Structures.Analysis.AnalysisModelIssue.SeverityEnum.Error
Error

Tekla.Structures.Analysis.AnalysisModelIssue.SeverityEnum.Warning
Warning

Tekla.Structures.Analysis.AnalysisModelIssue.SeverityEnum.Information
Information